import pytest

import pandas as pd


@pytest.fixture
def sample_df():
    return pd.DataFrame({
                "Дата операции": [
                "31.12.2021 16:44:00",
                "31.12.2021 16:42:04",
                "31.12.2021 16:39:04",
                "31.12.2021 15:44:39",
                "31.12.2021 01:23:42",
                "31.12.2021 00:12:53",
                "30.12.2021 22:22:03",
                "31.12.2021 00:12:53",
                "30.12.2021 22:22:03"
                ],
                "Дата платежа": [
                "01.10.2024",
                "02.10.2024",
                "03.10.2024",
                "01.11.2024",
                "02.11.2024",
                "03.11.2024",
                "01.12.2024",
                "02.12.2024",
                "03.12.2024",
                ],
                "Сумма платежа": [-100, -200, -300, -400, -500, -600, -700, -800, -900],
                "Категория": [
                "Супермаркеты",
                "Супермаркеты",
                "Кафе",
                "Супермаркеты",
                "Кафе",
                "Супермаркеты",
                "Кафе",
                "Супермаркеты",
                "Супермаркеты",
                ],
                "Описание": [
                "Магнит",
                "Пятерочка",
                "Кофейня",
                "Перекресток",
                "Шоколадница",
                "Ашан",
                "Кофейня",
                "Metro",
                "FixPrice",
                ],
                "Номер карты": ["*5091", "*1111", "*2222", "*3333", "*4444", "*5555", "*6666", "*7777", "*8888"]
    })

@pytest.fixture
def sample_2():
    return pd.DataFrame({"Дата платежа": ["01.10.2024",
                            "02.10.2024",
                            "03.10.2024",
                            "01.11.2024",
                            "02.11.2024"],
                        "Сумма операции":[-160.89,
                            -64.00,
                            -118.12,
                            -78.05,
                            -564.00],
                        "Номер карты": ["*7197",
                            "*7197",
                            "*7197",
                            "*7197",
                            "*5091"],
                        "Сумма операции с округлением": [160.89,
                            64.00,
                            118.12,
                            78.05,
                            564.00],
                        "Категория": ["Супермаркеты", "Супермаркеты", "Супермаркеты",
                                       "Супермаркеты", "Различные товары"],
                        "Описание": ["Колхоз", "Колхоз","Магнит",
                                        "Колхоз", "Ozon.ru"]
    })

@pytest.fixture
def numbers():
    return 3