import os

from pandas import Timestamp

from src.reports import file_wrapper, spending_by_category


def test_file_wrapper(sample_df):
    @file_wrapper("test_reports.log")
    def spending_by_category(sample_df):
        return sample_df
    if os.path.exists("test_reports.log"):
        os.remove("test_reports.log")
    spending_by_category(sample_df)
    with open ("test_reports.log", "r", encoding="utf-8") as l:
        datas= l.read()
    assert datas == ('[{"Дата операции":"31.12.2021 16:44:00","Дата платежа":"01.10.2024","Сумма '
 'платежа":-100,"Категория":"Супермаркеты","Описание":"Магнит","Номер '
 'карты":"*5091"},{"Дата операции":"31.12.2021 16:42:04","Дата '
 'платежа":"02.10.2024","Сумма '
 'платежа":-200,"Категория":"Супермаркеты","Описание":"Пятерочка","Номер '
 'карты":"*1111"},{"Дата операции":"31.12.2021 16:39:04","Дата '
 'платежа":"03.10.2024","Сумма '
 'платежа":-300,"Категория":"Кафе","Описание":"Кофейня","Номер '
 'карты":"*2222"},{"Дата операции":"31.12.2021 15:44:39","Дата '
 'платежа":"01.11.2024","Сумма '
 'платежа":-400,"Категория":"Супермаркеты","Описание":"Перекресток","Номер '
 'карты":"*3333"},{"Дата операции":"31.12.2021 01:23:42","Дата '
 'платежа":"02.11.2024","Сумма '
 'платежа":-500,"Категория":"Кафе","Описание":"Шоколадница","Номер '
 'карты":"*4444"},{"Дата операции":"31.12.2021 00:12:53","Дата '
 'платежа":"03.11.2024","Сумма '
 'платежа":-600,"Категория":"Супермаркеты","Описание":"Ашан","Номер '
 'карты":"*5555"},{"Дата операции":"30.12.2021 22:22:03","Дата '
 'платежа":"01.12.2024","Сумма '
 'платежа":-700,"Категория":"Кафе","Описание":"Кофейня","Номер '
 'карты":"*6666"},{"Дата операции":"31.12.2021 00:12:53","Дата '
 'платежа":"02.12.2024","Сумма '
 'платежа":-800,"Категория":"Супермаркеты","Описание":"Metro","Номер '
 'карты":"*7777"},{"Дата операции":"30.12.2021 22:22:03","Дата '
 'платежа":"03.12.2024","Сумма '
 'платежа":-900,"Категория":"Супермаркеты","Описание":"FixPrice","Номер '
 'карты":"*8888"}]')

def test_spending_by_category(sample_df):
    assert spending_by_category(sample_df, "Супермаркеты", "31.12.2021 16:44:00").to_dict() == {'Дата операции': {0: Timestamp('2021-12-31 16:44:00'),
                   1: Timestamp('2021-12-31 16:42:04'),
                   3: Timestamp('2021-12-31 15:44:39'),
                   5: Timestamp('2021-12-31 00:12:53'),
                   7: Timestamp('2021-12-31 00:12:53'),
                   8: Timestamp('2021-12-30 22:22:03')},
 'Дата платежа': {0: '01.10.2024',
                  1: '02.10.2024',
                  3: '01.11.2024',
                  5: '03.11.2024',
                  7: '02.12.2024',
                  8: '03.12.2024'},
 'Категория': {0: 'Супермаркеты',
               1: 'Супермаркеты',
               3: 'Супермаркеты',
               5: 'Супермаркеты',
               7: 'Супермаркеты',
               8: 'Супермаркеты'},
 'Номер карты': {0: '*5091',
                 1: '*1111',
                 3: '*3333',
                 5: '*5555',
                 7: '*7777',
                 8: '*8888'},
 'Описание': {0: 'Магнит',
              1: 'Пятерочка',
              3: 'Перекресток',
              5: 'Ашан',
              7: 'Metro',
              8: 'FixPrice'},
 'Сумма платежа': {0: -100, 1: -200, 3: -400, 5: -600, 7: -800, 8: -900}}

    assert spending_by_category(sample_df, "Пустой").to_dict()== {'Дата операции': {},
 'Дата платежа': {},
 'Категория': {},
 'Номер карты': {},
 'Описание': {},
 'Сумма платежа': {}}